ssh/app/controllers/sshes_controller.rb

  def create
    @ssh = Ssh.new(params[:ssh])
    @ssh.user_id = session[:username]
    @ssh.Email_id = session[:person].to_s

    respond_to do |format|
      if @ssh.save
---
INSERT INTO "sshes" ("name", "created_at", "updated_at", "phone_number", "Email_id", "ssh_key") VALUES('harsh', '2011-11-09 10:52:55', '2011-11-09 10:52:55', '839', 'yevlempy@gmail.com', 'ssh-dss AAAAB3NzaC1kc3MAAACBAN35+34QGpu/Y3drQ3OPUwG0cd4ma7BYg7Uwn2Dwv0/t9VXR 6lcbTMvOqVRC0Wwe/FQo1o1magdqIsCW08WrhAzTR+tAuRkdEUwvgzX9KVc1+Nb2huTTHtWBjshZ GKmCsQ75awFRbe6iEgTqjeXH5q6NDBhHchX6d4sfh+H6S1XHAAAAFQDoxKs0IbKAYY6NuGUjJ9FM i4YsHwAAAIAawOst2ODuMH99gqObCCqnHPFcYaH0DIvn+uxg5aXfe9a0JvxDD80e3QUIwiQl9iKE F+AfJMKnFHvGzlV089zu8fnawsnldcQ0nUBJQmZKCyAeym3zBGiBpiFFQIn/YHE+VCTPjRgaKsu3 GZgffIX34sufh19JL47Y7kqKHGROsgAAAIAizHAjCb4oui6Oc2HA7Rcod3JCpgFNEZvfPK8JA3mq Mr5Iik5B6Z6duSZVUqTCfDylTZFsHD8AOOdmEfgxnP4qsSMwnQHY3r42Zy0fpA4yGWwvzC4mY9DW qw4rgUFkHF+B04gzsFsu/5q/Lejen6zEilbiCOOQ9AkBLwlD/Nrflg== root@sysadm-Dell-Sy stem-Vostro-3450')

  def update
    @ssh = Ssh.find(params[:id])
    @ssh.user_id = session[:username]
    @ssh.Email_id = session[:person].to_s

    respond_to do |format|
      if @ssh.update_attributes(params[:ssh])
---
UPDATE "sshes" SET "updated_at" = '2011-11-14 12:48:58', "user_id" = 'Anil_kumar' WHERE "id" = 1